ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
#if 0
        Hex2Reg(public_k1, crpt->ECC_X1);
        Hex2Reg(public_k2, crpt->ECC_Y1);
#else

        /* 5-(2) Get the public key from key store */
        crpt->ECC_KSCTL = 0ul;
        crpt->ECC_KSXY = CRPT_ECC_KSXY_RSRCXY_Msk |
                         (mem_pk1 << CRPT_ECC_KSXY_RSSRCX_Pos) | ((uint32_t)i32KeyIdx_pk1 << CRPT_ECC_KSXY_NUMX_Pos) | // Key Store index of pk1
                         (mem_pk2 << CRPT_ECC_KSXY_RSSRCY_Pos) | ((uint32_t)i32KeyIdx_pk2 << CRPT_ECC_KSXY_NUMY_Pos);  // Key Store index of pk2

#endif

        /* (10) Write u2 to K registers */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_K[i] = temp_result2[i];
        }

        run_ecc_codec(crpt, ECCOP_POINT_MUL);

        for(i = 0; i < 18; i++)
        {
            temp_result1[i] = crpt->ECC_X1[i];
            temp_result2[i] = crpt->ECC_Y1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_result1, temp_hex_str);
        CRPT_DBGMSG("5-(13) u2*Q, x = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, temp_result2, temp_hex_str);
        CRPT_DBGMSG("5-(13) u2*Q, y = %s\n", temp_hex_str);
#endif

        /* (14) Write the curve parameter A, B, N, and curve length M to corresponding registers */
        ecc_init_curve(crpt, ecc_curve);

        /* Write the result data u2*Q to X1, Y1 registers */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_X1[i] = temp_result1[i];
            crpt->ECC_Y1[i] = temp_result2[i];
        }

        /* (15) Write the result data u1*G to X2, Y2 registers */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_X2[i] = temp_x[i];
            crpt->ECC_Y2[i] = temp_y[i];
        }

        run_ecc_codec(crpt, ECCOP_POINT_ADD);

        /* (19) Read X1, Y1 registers to get X・(x1・, y1・) */
        for(i = 0; i < 18; i++)
        {
            temp_x[i] = crpt->ECC_X1[i];
            temp_y[i] = crpt->ECC_Y1[i];
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, temp_x, temp_hex_str);
        CRPT_DBGMSG("5-(19) x' = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, temp_y, temp_hex_str);
        CRPT_DBGMSG("5-(19) y' = %s\n", temp_hex_str);
#endif

        /*  (20) Write the curve order and curve length to N ,M registers */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_N[i] = 0UL;
        }
        Hex2Reg(pCurve->Eorder, crpt->ECC_N);

        /*
         *  (21) Write x1・ to X1 registers
         *  (22) Write 0x0 to Y1 registers
         */
        for(i = 0; i < 18; i++)
        {
            crpt->ECC_X1[i] = temp_x[i];
            crpt->ECC_Y1[i] = 0UL;
        }

#if ENABLE_DEBUG
        Reg2Hex(pCurve->Echar, crpt->ECC_X1, temp_hex_str);
        CRPT_DBGMSG("5-(21) x' = %s\n", temp_hex_str);
        Reg2Hex(pCurve->Echar, crpt->ECC_Y1, temp_hex_str);
        CRPT_DBGMSG("5-(22) y' = %s\n", temp_hex_str);
#endif

        run_ecc_codec(crpt, ECCOP_MODULE | MODOP_ADD);

        /*  (27) Read X1 registers to get x1・ (mod n) */
        Reg2Hex(pCurve->Echar, crpt->ECC_X1, temp_hex_str);
        CRPT_DBGMSG("5-(27) x1' (mod n) = %s\n", temp_hex_str);

        /* 6. The signature is valid if x1・ = r, otherwise it is invalid */

        /* Compare with test pattern to check if r is correct or not */
        if(strcasecmp(temp_hex_str, R) != 0)
        {
            CRPT_DBGMSG("x1' (mod n) != R Test filed!!\n");
            CRPT_DBGMSG("Signature R [%s] is not matched with expected R [%s]!\n", temp_hex_str, R);
            ret = -2;
        }
    }  /* ret == 0 */

    return ret;
}



#if XOM_SUPPORT // To support XOM ready curve table

int32_t CurveCpy(unsigned int *p32, E_ECC_CURVE id)
{
    int32_t i;

    switch(id)
    {
    case CURVE_P_192:
        p32[  0] = 0x00000000;
        p32[  1] = 0x00000030;
        for(i = 2; i <= 8; i++)
            p32[i] = 0x46464646;

        p32[  9] = 0x45464646;
        p32[ 10] = 0x46464646;
        p32[ 11] = 0x46464646;
        p32[ 12] = 0x46464646;
        p32[ 13] = 0x43464646;
        for(i = 14; i <= 37; i++)
            p32[i] = 0x00000000;

        p32[ 38] = 0x31323436;
        p32[ 39] = 0x39313530;
        p32[ 40] = 0x63393565;
        p32[ 41] = 0x37653038;
        p32[ 42] = 0x37616630;
        p32[ 43] = 0x62613965;
        p32[ 44] = 0x34323237;
        p32[ 45] = 0x39343033;
        p32[ 46] = 0x38626566;
        p32[ 47] = 0x63656564;
        p32[ 48] = 0x36343163;
        p32[ 49] = 0x31623962;
        for(i = 50; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x64383831;
        p32[ 75] = 0x65303861;
        p32[ 76] = 0x30333062;
        p32[ 77] = 0x36663039;
        p32[ 78] = 0x66626337;
        p32[ 79] = 0x62653032;
        p32[ 80] = 0x31613334;
        p32[ 81] = 0x30303838;
        p32[ 82] = 0x66663466;
        p32[ 83] = 0x64666130;
        p32[ 84] = 0x66663238;
        p32[ 85] = 0x32313031;
        for(i = 86; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x39313730;
        p32[111] = 0x35396232;
        p32[112] = 0x38636666;
        p32[113] = 0x38376164;
        p32[114] = 0x30313336;
        p32[115] = 0x64653131;
        p32[116] = 0x34326236;
        p32[117] = 0x35646463;
        p32[118] = 0x39663337;
        p32[119] = 0x31613737;
        p32[120] = 0x39376531;
        p32[121] = 0x31313834;
        for(i = 122; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x0000003a;
        for(i = 147; i <= 153; i++)
            p32[i] = 0x46464646;

        p32[154] = 0x45464646;
        for(i = 155; i <= 158; i++)
            p32[i] = 0x46464646;

        for(i = 159; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x0000003a;
        for(i = 192; i <= 197; i++)
            p32[i] = 0x46464646;

        p32[198] = 0x45443939;
        p32[199] = 0x36333846;
        p32[200] = 0x42363431;
        p32[201] = 0x31423943;
        p32[202] = 0x32443442;
        p32[203] = 0x31333832;
        for(i = 204; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x000000c0;
        p32[237] = 0x00000007;
        p32[238] = 0x00000002;
        p32[239] = 0x00000001;
        p32[240] = 0x00000000;
        break;
    case CURVE_P_224:
        p32[  0] = 0x00000001;
        p32[  1] = 0x00000038;
        for(i = 2; i <= 8; i++)
            p32[i] = 0x46464646;

        p32[  9] = 0x45464646;
        for(i = 10; i <= 14; i++)
            p32[i] = 0x46464646;

