ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
        p32[ 15] = 0x45464646;
        for(i = 16; i <= 37; i++)
            p32[i] = 0x00000000;

        p32[ 38] = 0x35303462;
        p32[ 39] = 0x35386130;
        p32[ 40] = 0x34306330;
        p32[ 41] = 0x62613362;
        p32[ 42] = 0x31343566;
        p32[ 43] = 0x36353233;
        p32[ 44] = 0x34343035;
        p32[ 45] = 0x37623062;
        p32[ 46] = 0x66623764;
        p32[ 47] = 0x61623864;
        p32[ 48] = 0x62303732;
        p32[ 49] = 0x33343933;
        p32[ 50] = 0x35353332;
        p32[ 51] = 0x34626666;
        for(i = 52; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x65303762;
        p32[ 75] = 0x64626330;
        p32[ 76] = 0x34626236;
        p32[ 77] = 0x66376662;
        p32[ 78] = 0x33313233;
        p32[ 79] = 0x39623039;
        p32[ 80] = 0x33306134;
        p32[ 81] = 0x33643163;
        p32[ 82] = 0x32633635;
        p32[ 83] = 0x32323131;
        p32[ 84] = 0x32333433;
        p32[ 85] = 0x36643038;
        p32[ 86] = 0x63353131;
        p32[ 87] = 0x31326431;
        for(i = 88; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x37336462;
        p32[111] = 0x38383336;
        p32[112] = 0x37663562;
        p32[113] = 0x62663332;
        p32[114] = 0x32326334;
        p32[115] = 0x36656664;
        p32[116] = 0x33346463;
        p32[117] = 0x30613537;
        p32[118] = 0x37306135;
        p32[119] = 0x34363734;
        p32[120] = 0x35643434;
        p32[121] = 0x39393138;
        p32[122] = 0x30303538;
        p32[123] = 0x34336537;
        for(i = 124; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000046;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000046;
        for(i = 192; i <= 198; i++)
            p32[i] = 0x46464646;

        p32[199] = 0x32413631;
        p32[200] = 0x38423045;
        p32[201] = 0x45333046;
        p32[202] = 0x44443331;
        p32[203] = 0x35343932;
        p32[204] = 0x43354335;
        p32[205] = 0x44334132;
        for(i = 206; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x000000e0;
        p32[237] = 0x00000009;
        p32[238] = 0x00000008;
        p32[239] = 0x00000003;
        p32[240] = 0x00000000;
        break;
    case CURVE_P_256:
        p32[  0] = 0x00000002;
        p32[  1] = 0x00000040;
        p32[  2] = 0x46464646;
        p32[  3] = 0x46464646;
        p32[  4] = 0x30303030;
        p32[  5] = 0x31303030;
        for(i = 6; i <= 11; i++)
            p32[i] = 0x30303030;

        for(i = 12; i <= 16; i++)
            p32[i] = 0x46464646;

        p32[ 17] = 0x43464646;
        for(i = 18; i <= 37; i++)
            p32[i] = 0x00000000;

        p32[ 38] = 0x36636135;
        p32[ 39] = 0x38643533;
        p32[ 40] = 0x61336161;
        p32[ 41] = 0x37653339;
        p32[ 42] = 0x62653362;
        p32[ 43] = 0x35356462;
        p32[ 44] = 0x38393637;
        p32[ 45] = 0x63623638;
        p32[ 46] = 0x64313536;
        p32[ 47] = 0x30623630;
        p32[ 48] = 0x33356363;
        p32[ 49] = 0x36663062;
        p32[ 50] = 0x65636233;
        p32[ 51] = 0x65336333;
        p32[ 52] = 0x32643732;
        p32[ 53] = 0x62343036;
        for(i = 54; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x37316236;
        p32[ 75] = 0x32663164;
        p32[ 76] = 0x63323165;
        p32[ 77] = 0x37343234;
        p32[ 78] = 0x63623866;
        p32[ 79] = 0x35653665;
        p32[ 80] = 0x34613336;
        p32[ 81] = 0x32663034;
        p32[ 82] = 0x33303737;
        p32[ 83] = 0x31386437;
        p32[ 84] = 0x62656432;
        p32[ 85] = 0x30613333;
        p32[ 86] = 0x31613466;
        p32[ 87] = 0x35343933;
        p32[ 88] = 0x38393864;
        p32[ 89] = 0x36393263;
        for(i = 90; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x33656634;
        p32[111] = 0x32653234;
        p32[112] = 0x61316566;
        p32[113] = 0x62396637;
        p32[114] = 0x37656538;
        p32[115] = 0x61346265;
        p32[116] = 0x66306337;
        p32[117] = 0x36316539;
        p32[118] = 0x65636232;
        p32[119] = 0x37353333;
        p32[120] = 0x31336236;
        p32[121] = 0x65636535;
        p32[122] = 0x36626263;
        p32[123] = 0x38363034;
        p32[124] = 0x66623733;
        p32[125] = 0x35663135;
        for(i = 126; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x0000004e;
        p32[147] = 0x46464646;
        p32[148] = 0x46464646;
        p32[149] = 0x30303030;
        p32[150] = 0x31303030;
        for(i = 151; i <= 156; i++)
            p32[i] = 0x30303030;

        for(i = 157; i <= 162; i++)
            p32[i] = 0x46464646;

        for(i = 163; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x0000004e;
        p32[192] = 0x46464646;
        p32[193] = 0x46464646;
        p32[194] = 0x30303030;
        p32[195] = 0x30303030;
        for(i = 196; i <= 199; i++)
            p32[i] = 0x46464646;

        p32[200] = 0x36454342;
        p32[201] = 0x44414146;
        p32[202] = 0x37313741;
        p32[203] = 0x34384539;
        p32[204] = 0x39423346;
        p32[205] = 0x32434143;
        p32[206] = 0x33364346;
        p32[207] = 0x31353532;
        for(i = 208; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x00000100;
        p32[237] = 0x0000000a;
        p32[238] = 0x00000005;
        p32[239] = 0x00000002;
        p32[240] = 0x00000000;
        break;
    case CURVE_P_384:
        p32[  0] = 0x00000003;
        p32[  1] = 0x00000060;
        for(i = 2; i <= 16; i++)
            p32[i] = 0x46464646;

        p32[ 17] = 0x45464646;
        p32[ 18] = 0x46464646;
        p32[ 19] = 0x46464646;
        for(i = 20; i <= 23; i++)
            p32[i] = 0x30303030;

        p32[ 24] = 0x46464646;
        p32[ 25] = 0x43464646;
        for(i = 26; i <= 37; i++)
            p32[i] = 0x00000000;

