ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
        p32[ 38] = 0x31333362;
        p32[ 39] = 0x37616632;
        p32[ 40] = 0x65333265;
        p32[ 41] = 0x34653765;
        p32[ 42] = 0x65383839;
        p32[ 43] = 0x62363530;
        p32[ 44] = 0x38663365;
        p32[ 45] = 0x39316432;
        p32[ 46] = 0x64313831;
        p32[ 47] = 0x65366339;
        p32[ 48] = 0x31386566;
        p32[ 49] = 0x32313134;
        p32[ 50] = 0x34313330;
        p32[ 51] = 0x66383830;
        p32[ 52] = 0x33313035;
        p32[ 53] = 0x61353738;
        p32[ 54] = 0x36353663;
        p32[ 55] = 0x64383933;
        p32[ 56] = 0x65326138;
        p32[ 57] = 0x64393164;
        p32[ 58] = 0x35386132;
        p32[ 59] = 0x64653863;
        p32[ 60] = 0x63653364;
        p32[ 61] = 0x66656132;
        for(i = 62; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x37386161;
        p32[ 75] = 0x32326163;
        p32[ 76] = 0x62386562;
        p32[ 77] = 0x37333530;
        p32[ 78] = 0x31626538;
        p32[ 79] = 0x65313763;
        p32[ 80] = 0x30323366;
        p32[ 81] = 0x34376461;
        p32[ 82] = 0x64316536;
        p32[ 83] = 0x32366233;
        p32[ 84] = 0x37616238;
        p32[ 85] = 0x38396239;
        p32[ 86] = 0x37663935;
        p32[ 87] = 0x30653134;
        p32[ 88] = 0x34353238;
        p32[ 89] = 0x38336132;
        p32[ 90] = 0x32303535;
        p32[ 91] = 0x64353266;
        p32[ 92] = 0x35356662;
        p32[ 93] = 0x63363932;
        p32[ 94] = 0x34356133;
        p32[ 95] = 0x38336535;
        p32[ 96] = 0x36373237;
        p32[ 97] = 0x37626130;
        for(i = 98; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x37313633;
        p32[111] = 0x61346564;
        p32[112] = 0x36323639;
        p32[113] = 0x66366332;
        p32[114] = 0x65396435;
        p32[115] = 0x66623839;
        p32[116] = 0x32393239;
        p32[117] = 0x39326364;
        p32[118] = 0x34663866;
        p32[119] = 0x64626431;
        p32[120] = 0x61393832;
        p32[121] = 0x63373431;
        p32[122] = 0x61643965;
        p32[123] = 0x33313133;
        p32[124] = 0x30663562;
        p32[125] = 0x30633862;
        p32[126] = 0x30366130;
        p32[127] = 0x65633162;
        p32[128] = 0x65376431;
        p32[129] = 0x64393138;
        p32[130] = 0x33346137;
        p32[131] = 0x63376431;
        p32[132] = 0x61653039;
        p32[133] = 0x66356530;
        for(i = 134; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000074;
        for(i = 147; i <= 161; i++)
            p32[i] = 0x46464646;

        p32[162] = 0x45464646;
        p32[163] = 0x46464646;
        p32[164] = 0x46464646;
        for(i = 165; i <= 168; i++)
            p32[i] = 0x30303030;

        p32[169] = 0x46464646;
        p32[170] = 0x46464646;
        for(i = 171; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000074;
        for(i = 192; i <= 203; i++)
            p32[i] = 0x46464646;

        p32[204] = 0x33363743;
        p32[205] = 0x31384434;
        p32[206] = 0x37333446;
        p32[207] = 0x46444432;
        p32[208] = 0x41313835;
        p32[209] = 0x32424430;
        p32[210] = 0x30423834;
        p32[211] = 0x41373741;
        p32[212] = 0x43454345;
        p32[213] = 0x41363931;
        p32[214] = 0x35434343;
        p32[215] = 0x33373932;
        for(i = 216; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x00000180;
        p32[237] = 0x0000000c;
        p32[238] = 0x00000003;
        p32[239] = 0x00000002;
        p32[240] = 0x00000000;
        break;
    case CURVE_P_521:
        p32[  0] = 0x00000004;
        p32[  1] = 0x00000083;
        p32[  2] = 0x46464631;
        for(i = 3; i <= 33; i++)
            p32[i] = 0x46464646;

        p32[ 34] = 0x00434646;
        p32[ 35] = 0x00000000;
        p32[ 36] = 0x00000000;
        p32[ 37] = 0x00000000;
        p32[ 38] = 0x39313530;
        p32[ 39] = 0x62653335;
        p32[ 40] = 0x38313639;
        p32[ 41] = 0x39633165;
        p32[ 42] = 0x39663161;
        p32[ 43] = 0x32613932;
        p32[ 44] = 0x62306131;
        p32[ 45] = 0x34353836;
        p32[ 46] = 0x61656530;
        p32[ 47] = 0x37616432;
        p32[ 48] = 0x39623532;
        p32[ 49] = 0x31336239;
        p32[ 50] = 0x62336635;
        p32[ 51] = 0x38346238;
        p32[ 52] = 0x38313939;
        p32[ 53] = 0x30316665;
        p32[ 54] = 0x35316539;
        p32[ 55] = 0x33393136;
        p32[ 56] = 0x65313539;
        p32[ 57] = 0x39653763;
        p32[ 58] = 0x31623733;
        p32[ 59] = 0x63323536;
        p32[ 60] = 0x33646230;
        p32[ 61] = 0x62316262;
        p32[ 62] = 0x33373066;
        p32[ 63] = 0x64333735;
        p32[ 64] = 0x33383866;
        p32[ 65] = 0x33633264;
        p32[ 66] = 0x65316634;
        p32[ 67] = 0x31353466;
        p32[ 68] = 0x36346466;
        p32[ 69] = 0x33303562;
        p32[ 70] = 0x00303066;
        p32[ 71] = 0x00000000;
        p32[ 72] = 0x00000000;
        p32[ 73] = 0x00000000;
        p32[ 74] = 0x38366330;
        p32[ 75] = 0x30653835;
        p32[ 76] = 0x30376236;
        p32[ 77] = 0x65343034;
        p32[ 78] = 0x39646339;
        p32[ 79] = 0x63653365;
        p32[ 80] = 0x32363662;
        p32[ 81] = 0x62353933;
        p32[ 82] = 0x39323434;
        p32[ 83] = 0x38343663;
        p32[ 84] = 0x30393331;
        p32[ 85] = 0x62663335;
        p32[ 86] = 0x66313235;
        p32[ 87] = 0x61383238;
        p32[ 88] = 0x36303666;
        p32[ 89] = 0x33643462;
        p32[ 90] = 0x61616264;
        p32[ 91] = 0x35623431;
        p32[ 92] = 0x65373765;
        p32[ 93] = 0x35376566;
        p32[ 94] = 0x66383239;
        p32[ 95] = 0x63643165;
        p32[ 96] = 0x61373231;
        p32[ 97] = 0x61666632;
        p32[ 98] = 0x33656438;
        p32[ 99] = 0x62383433;
        p32[100] = 0x38316333;
        p32[101] = 0x34613635;
        p32[102] = 0x66623932;
        p32[103] = 0x37653739;
        p32[104] = 0x63313365;
        p32[105] = 0x62356532;
        p32[106] = 0x00363664;
        p32[107] = 0x00000000;
        p32[108] = 0x00000000;
        p32[109] = 0x00000000;
        p32[110] = 0x33383131;
        p32[111] = 0x36393239;
        p32[112] = 0x39383761;
        p32[113] = 0x63623361;
        p32[114] = 0x35343030;
        p32[115] = 0x35613863;
        p32[116] = 0x32346266;
        p32[117] = 0x31643763;
        p32[118] = 0x39396462;
        p32[119] = 0x34356638;
        p32[120] = 0x35393434;
        p32[121] = 0x34623937;
        p32[122] = 0x31383634;
        p32[123] = 0x62666137;
        p32[124] = 0x32373164;
        p32[125] = 0x36653337;
        p32[126] = 0x39633236;
        p32[127] = 0x37656537;
        p32[128] = 0x35393932;
        p32[129] = 0x32346665;
        p32[130] = 0x63303436;
        p32[131] = 0x62303535;
        p32[132] = 0x33313039;
        p32[133] = 0x30646166;
        p32[134] = 0x33313637;
        p32[135] = 0x37633335;
        p32[136] = 0x61363830;
        p32[137] = 0x63323732;
        p32[138] = 0x38303432;
        p32[139] = 0x39656238;
        p32[140] = 0x39363734;
        p32[141] = 0x36316466;
        p32[142] = 0x00303536;
        p32[143] = 0x00000000;
        p32[144] = 0x00000000;
        p32[145] = 0x00000000;
        p32[146] = 0x0000009d;
        p32[147] = 0x46464631;
        for(i = 148; i <= 178; i++)
            p32[i] = 0x46464646;

        p32[179] = 0x00464646;
        for(i = 180; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x0000009d;
        p32[192] = 0x46464631;
        for(i = 193; i <= 207; i++)
            p32[i] = 0x46464646;

