ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
        p32[208] = 0x35414646;
        p32[209] = 0x38363831;
        p32[210] = 0x42333837;
        p32[211] = 0x39463246;
        p32[212] = 0x37423636;
        p32[213] = 0x30434346;
        p32[214] = 0x46383431;
        p32[215] = 0x41393037;
        p32[216] = 0x33304435;
        p32[217] = 0x43354242;
        p32[218] = 0x38384239;
        p32[219] = 0x34433939;
        p32[220] = 0x42454137;
        p32[221] = 0x42463642;
        p32[222] = 0x39453137;
        p32[223] = 0x36383331;
        p32[224] = 0x00393034;
        for(i = 225; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x00000209;
        p32[237] = 0x00000020;
        p32[238] = 0x00000020;
        p32[239] = 0x00000020;
        p32[240] = 0x00000000;
        break;
    case CURVE_B_163:
        p32[  0] = 0x0000000a;
        p32[  1] = 0x00000029;
        for(i = 2; i <= 11; i++)
            p32[i] = 0x30303030;

        p32[ 12] = 0x00000031;
        for(i = 13; i <= 37; i++)
            p32[i] = 0x00000000;

        p32[ 38] = 0x36613032;
        p32[ 39] = 0x30393130;
        p32[ 40] = 0x63386237;
        p32[ 41] = 0x63333539;
        p32[ 42] = 0x38343161;
        p32[ 43] = 0x31626531;
        p32[ 44] = 0x32313530;
        p32[ 45] = 0x37383766;
        p32[ 46] = 0x33613434;
        p32[ 47] = 0x66353032;
        p32[ 48] = 0x00000064;
        for(i = 49; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x65306633;
        p32[ 75] = 0x36316162;
        p32[ 76] = 0x61363832;
        p32[ 77] = 0x37356432;
        p32[ 78] = 0x39306165;
        p32[ 79] = 0x36313139;
        p32[ 80] = 0x39346438;
        p32[ 81] = 0x33363439;
        p32[ 82] = 0x33386537;
        p32[ 83] = 0x33653334;
        p32[ 84] = 0x00000036;
        for(i = 85; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x31356430;
        p32[111] = 0x36636266;
        p32[112] = 0x61313763;
        p32[113] = 0x34393030;
        p32[114] = 0x63326166;
        p32[115] = 0x34356464;
        p32[116] = 0x31316235;
        p32[117] = 0x30633563;
        p32[118] = 0x37393763;
        p32[119] = 0x66343233;
        p32[120] = 0x00000031;
        for(i = 121; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000031;
        p32[192] = 0x30303034;
        for(i = 193; i <= 196; i++)
            p32[i] = 0x30303030;

        p32[197] = 0x46323932;
        p32[198] = 0x45373745;
        p32[199] = 0x31433037;
        p32[200] = 0x32344132;
        p32[201] = 0x33433433;
        p32[202] = 0x00000033;
        for(i = 203; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x000000a3;
        p32[237] = 0x00000007;
        p32[238] = 0x00000006;
        p32[239] = 0x00000003;
        p32[240] = 0x00000001;
        break;
    case CURVE_B_233:
        p32[  0] = 0x0000000b;
        p32[  1] = 0x0000003b;
        for(i = 2; i <= 15; i++)
            p32[i] = 0x30303030;

        p32[ 16] = 0x00313030;
        for(i = 17; i <= 37; i++)
            p32[i] = 0x00000000;

        p32[ 38] = 0x36363630;
        p32[ 39] = 0x64653734;
        p32[ 40] = 0x33633665;
        p32[ 41] = 0x37633233;
        p32[ 42] = 0x30633866;
        p32[ 43] = 0x62333239;
        p32[ 44] = 0x32383562;
        p32[ 45] = 0x33623331;
        p32[ 46] = 0x32623333;
        p32[ 47] = 0x63396530;
        p32[ 48] = 0x38323465;
        p32[ 49] = 0x31656631;
        p32[ 50] = 0x37663531;
        p32[ 51] = 0x39663864;
        p32[ 52] = 0x00646130;
        for(i = 53; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x63616630;
        p32[ 75] = 0x63666439;
        p32[ 76] = 0x38636162;
        p32[ 77] = 0x62333133;
        p32[ 78] = 0x33313262;
        p32[ 79] = 0x62316639;
        p32[ 80] = 0x35353762;
        p32[ 81] = 0x36666566;
        p32[ 82] = 0x33636235;
        p32[ 83] = 0x38663139;
        p32[ 84] = 0x66363362;
        p32[ 85] = 0x65386638;
        p32[ 86] = 0x37333762;
        p32[ 87] = 0x35646631;
        p32[ 88] = 0x00623835;
        for(i = 89; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x36303031;
        p32[111] = 0x61383061;
        p32[112] = 0x30393134;
        p32[113] = 0x30353333;
        p32[114] = 0x65383736;
        p32[115] = 0x32353835;
        p32[116] = 0x62656238;
        p32[117] = 0x30613866;
        p32[118] = 0x66666562;
        p32[119] = 0x61373638;
        p32[120] = 0x33616337;
        p32[121] = 0x36313736;
        p32[122] = 0x30653766;
        p32[123] = 0x31386631;
        p32[124] = 0x00323530;
        for(i = 125; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000046;
        p32[192] = 0x30303031;
        for(i = 193; i <= 198; i++)
            p32[i] = 0x30303030;

        p32[199] = 0x45333130;
        p32[200] = 0x45343739;
        p32[201] = 0x38463237;
        p32[202] = 0x32393641;
        p32[203] = 0x31333032;
        p32[204] = 0x30363244;
        p32[205] = 0x45464333;
        p32[206] = 0x00374430;
        for(i = 207; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x000000e9;
        p32[237] = 0x0000004a;
        p32[238] = 0x0000004a;
        p32[239] = 0x0000004a;
        p32[240] = 0x00000001;
        break;
    case CURVE_B_283:
        p32[  0] = 0x0000000c;
        p32[  1] = 0x00000047;
        for(i = 2; i <= 18; i++)
            p32[i] = 0x30303030;

        p32[ 19] = 0x00313030;
        for(i = 20; i <= 37; i++)
            p32[i] = 0x00000000;

        p32[ 38] = 0x36623732;
        p32[ 39] = 0x63613038;
        p32[ 40] = 0x35386238;
        p32[ 41] = 0x61643639;
        p32[ 42] = 0x61346135;
        p32[ 43] = 0x31613866;
        p32[ 44] = 0x33306139;
        p32[ 45] = 0x63663330;
        p32[ 46] = 0x66373961;
        p32[ 47] = 0x34363764;
        p32[ 48] = 0x39303335;
        p32[ 49] = 0x61326166;
        p32[ 50] = 0x34313835;
        p32[ 51] = 0x66613538;
        p32[ 52] = 0x33363236;
        p32[ 53] = 0x33313365;
        p32[ 54] = 0x61393762;
        p32[ 55] = 0x00356632;
        for(i = 56; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x33396635;
        p32[ 75] = 0x38353239;
        p32[ 76] = 0x64376264;
        p32[ 77] = 0x65303964;
        p32[ 78] = 0x34333931;
        p32[ 79] = 0x37633866;
        p32[ 80] = 0x64306230;
        p32[ 81] = 0x32636566;
        p32[ 82] = 0x32646565;
        p32[ 83] = 0x35386235;
        p32[ 84] = 0x61653735;
        p32[ 85] = 0x38633963;
        p32[ 86] = 0x65326530;
        p32[ 87] = 0x66383931;
        p32[ 88] = 0x62646338;
        p32[ 89] = 0x38646365;
        p32[ 90] = 0x32316236;
        p32[ 91] = 0x00333530;
        for(i = 92; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x36373633;
        p32[111] = 0x66343538;
        p32[112] = 0x31343265;
        p32[113] = 0x62633134;
        p32[114] = 0x65663839;
        p32[115] = 0x62346436;
        p32[116] = 0x30643032;
        p32[117] = 0x35346232;
        p32[118] = 0x66663631;
        p32[119] = 0x33323037;
        p32[120] = 0x64653035;
        p32[121] = 0x38306264;
        p32[122] = 0x37373632;
        p32[123] = 0x31386339;
        p32[124] = 0x64306633;
        p32[125] = 0x62353466;
        p32[126] = 0x31313865;
        p32[127] = 0x00346632;
        for(i = 128; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000055;
        p32[192] = 0x46464633;
        for(i = 193; i <= 199; i++)
            p32[i] = 0x46464646;

        p32[200] = 0x45464646;
        p32[201] = 0x33303946;
        p32[202] = 0x36363939;
        p32[203] = 0x39434630;
        p32[204] = 0x39413833;
        p32[205] = 0x35363130;
        p32[206] = 0x32343042;
        p32[207] = 0x45433741;
        p32[208] = 0x42444146;
        p32[209] = 0x00373033;
        for(i = 210; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x0000011b;
        p32[237] = 0x0000000c;
        p32[238] = 0x00000007;
        p32[239] = 0x00000005;
        p32[240] = 0x00000001;
        break;
    case CURVE_B_409:
        p32[  0] = 0x0000000d;
        p32[  1] = 0x00000067;
        for(i = 2; i <= 26; i++)
            p32[i] = 0x30303030;

        p32[ 27] = 0x00313030;
        for(i = 28; i <= 37; i++)
            p32[i] = 0x00000000;

