ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
        p32[ 38] = 0x61313230;
        p32[ 39] = 0x63326335;
        p32[ 40] = 0x39656538;
        p32[ 41] = 0x35626566;
        p32[ 42] = 0x39623463;
        p32[ 43] = 0x33353761;
        p32[ 44] = 0x34623762;
        p32[ 45] = 0x37623637;
        p32[ 46] = 0x34366466;
        p32[ 47] = 0x66653232;
        p32[ 48] = 0x64336631;
        p32[ 49] = 0x34373664;
        p32[ 50] = 0x66313637;
        p32[ 51] = 0x64393961;
        p32[ 52] = 0x32636136;
        p32[ 53] = 0x61386337;
        p32[ 54] = 0x39316139;
        p32[ 55] = 0x37326237;
        p32[ 56] = 0x32323832;
        p32[ 57] = 0x64633666;
        p32[ 58] = 0x35613735;
        p32[ 59] = 0x34616135;
        p32[ 60] = 0x61303566;
        p32[ 61] = 0x37313365;
        p32[ 62] = 0x35333162;
        p32[ 63] = 0x00663534;
        for(i = 64; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x34643531;
        p32[ 75] = 0x64303638;
        p32[ 76] = 0x64383830;
        p32[ 77] = 0x34336264;
        p32[ 78] = 0x30623639;
        p32[ 79] = 0x36303663;
        p32[ 80] = 0x36353734;
        p32[ 81] = 0x34303632;
        p32[ 82] = 0x64633134;
        p32[ 83] = 0x66613465;
        p32[ 84] = 0x31373731;
        p32[ 85] = 0x62643464;
        p32[ 86] = 0x66663130;
        p32[ 87] = 0x33623565;
        p32[ 88] = 0x39356534;
        p32[ 89] = 0x64333037;
        p32[ 90] = 0x35353263;
        p32[ 91] = 0x38363861;
        p32[ 92] = 0x38313161;
        p32[ 93] = 0x35313530;
        p32[ 94] = 0x61333036;
        p32[ 95] = 0x36626165;
        p32[ 96] = 0x34393730;
        p32[ 97] = 0x62343565;
        p32[ 98] = 0x39393762;
        p32[ 99] = 0x00376136;
        for(i = 100; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x62313630;
        p32[111] = 0x61666331;
        p32[112] = 0x65623662;
        p32[113] = 0x32336635;
        p32[114] = 0x61666262;
        p32[115] = 0x32333837;
        p32[116] = 0x31646534;
        p32[117] = 0x37613630;
        p32[118] = 0x62363336;
        p32[119] = 0x61356339;
        p32[120] = 0x31646237;
        p32[121] = 0x30643839;
        p32[122] = 0x61383531;
        p32[123] = 0x35663461;
        p32[124] = 0x64383834;
        p32[125] = 0x33663830;
        p32[126] = 0x34313538;
        p32[127] = 0x64663166;
        p32[128] = 0x34623466;
        p32[129] = 0x64303466;
        p32[130] = 0x31383132;
        p32[131] = 0x38363362;
        p32[132] = 0x36336331;
        p32[133] = 0x30616234;
        p32[134] = 0x63333732;
        p32[135] = 0x00363037;
        for(i = 136; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x0000007b;
        p32[192] = 0x30303031;
        for(i = 193; i <= 204; i++)
            p32[i] = 0x30303030;

        p32[205] = 0x41324531;
        p32[206] = 0x41364441;
        p32[207] = 0x46323136;
        p32[208] = 0x30333333;
        p32[209] = 0x35454237;
        p32[210] = 0x37344146;
        p32[211] = 0x39433343;
        p32[212] = 0x32353045;
        p32[213] = 0x38333846;
        p32[214] = 0x43343631;
        p32[215] = 0x44373344;
        p32[216] = 0x31324139;
        p32[217] = 0x00333731;
        for(i = 218; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x00000199;
        p32[237] = 0x00000057;
        p32[238] = 0x00000057;
        p32[239] = 0x00000057;
        p32[240] = 0x00000001;
        break;
    case CURVE_B_571:
        p32[  0] = 0x0000000e;
        p32[  1] = 0x0000008f;
        for(i = 2; i <= 36; i++)
            p32[i] = 0x30303030;

        p32[ 37] = 0x00313030;
        p32[ 38] = 0x30346632;
        p32[ 39] = 0x32653765;
        p32[ 40] = 0x66313232;
        p32[ 41] = 0x64353932;
        p32[ 42] = 0x37393265;
        p32[ 43] = 0x62373131;
        p32[ 44] = 0x64336637;
        p32[ 45] = 0x35663236;
        p32[ 46] = 0x39613663;
        p32[ 47] = 0x63666637;
        p32[ 48] = 0x65633862;
        p32[ 49] = 0x63316666;
        p32[ 50] = 0x61623664;
        p32[ 51] = 0x34656338;
        p32[ 52] = 0x31613961;
        p32[ 53] = 0x38646138;
        p32[ 54] = 0x61666634;
        p32[ 55] = 0x38646262;
        p32[ 56] = 0x35616665;
        p32[ 57] = 0x32333339;
        p32[ 58] = 0x61376562;
        p32[ 59] = 0x35373664;
        p32[ 60] = 0x36366136;
        p32[ 61] = 0x34393265;
        p32[ 62] = 0x31646661;
        p32[ 63] = 0x37613538;
        p32[ 64] = 0x31666638;
        p32[ 65] = 0x35616132;
        p32[ 66] = 0x34653032;
        p32[ 67] = 0x33376564;
        p32[ 68] = 0x63616239;
        p32[ 69] = 0x37633061;
        p32[ 70] = 0x66656666;
        p32[ 71] = 0x32663766;
        p32[ 72] = 0x37353539;
        p32[ 73] = 0x00613732;
        p32[ 74] = 0x30333033;
        p32[ 75] = 0x33643130;
        p32[ 76] = 0x35386234;
        p32[ 77] = 0x36393236;
        p32[ 78] = 0x63363163;
        p32[ 79] = 0x30346430;
        p32[ 80] = 0x64633364;
        p32[ 81] = 0x30353737;
        p32[ 82] = 0x64333961;
        p32[ 83] = 0x39326431;
        p32[ 84] = 0x61663535;
        p32[ 85] = 0x61613038;
        p32[ 86] = 0x30346635;
        p32[ 87] = 0x64386366;
        p32[ 88] = 0x32623762;
        p32[ 89] = 0x62646261;
        p32[ 90] = 0x33356564;
        p32[ 91] = 0x66303539;
        p32[ 92] = 0x64306334;
        p32[ 93] = 0x63333932;
        p32[ 94] = 0x31376464;
        p32[ 95] = 0x35336131;
        p32[ 96] = 0x66373662;
        p32[ 97] = 0x39343162;
        p32[ 98] = 0x36656139;
        p32[ 99] = 0x38333030;
        p32[100] = 0x66343136;
        p32[101] = 0x34393331;
        p32[102] = 0x61666261;
        p32[103] = 0x63346233;
        p32[104] = 0x64303538;
        p32[105] = 0x65373239;
        p32[106] = 0x37376531;
        p32[107] = 0x38633936;
        p32[108] = 0x32636565;
        p32[109] = 0x00393164;
        p32[110] = 0x66623733;
        p32[111] = 0x34333732;
        p32[112] = 0x36616432;
        p32[113] = 0x36623933;
        p32[114] = 0x66636364;
        p32[115] = 0x62656666;
        p32[116] = 0x36643337;
        p32[117] = 0x38376439;
        p32[118] = 0x32633663;
        p32[119] = 0x30366137;
        p32[120] = 0x62633930;
        p32[121] = 0x31616362;
        p32[122] = 0x66303839;
        p32[123] = 0x33333538;
        p32[124] = 0x65313239;
        p32[125] = 0x38366138;
        p32[126] = 0x33323434;
        p32[127] = 0x62333465;
        p32[128] = 0x38306261;
        p32[129] = 0x36373561;
        p32[130] = 0x61313932;
        p32[131] = 0x34663866;
        p32[132] = 0x62623136;
        p32[133] = 0x62386132;
        p32[134] = 0x31333533;
        p32[135] = 0x30663264;
        p32[136] = 0x63353834;
        p32[137] = 0x31623931;
        p32[138] = 0x66326536;
        p32[139] = 0x36313531;
        p32[140] = 0x64333265;
        p32[141] = 0x31633364;
        p32[142] = 0x32383461;
        p32[143] = 0x31666137;
        p32[144] = 0x63613862;
        p32[145] = 0x00623531;
        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

