ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
        p32[191] = 0x000000ac;
        p32[192] = 0x46464633;
        for(i = 193; i <= 208; i++)
            p32[i] = 0x46464646;

        p32[209] = 0x45464646;
        p32[210] = 0x43313636;
        p32[211] = 0x46383145;
        p32[212] = 0x39353546;
        p32[213] = 0x30333738;
        p32[214] = 0x39353038;
        p32[215] = 0x36383142;
        p32[216] = 0x38333238;
        p32[217] = 0x43453135;
        p32[218] = 0x39444437;
        p32[219] = 0x31314143;
        p32[220] = 0x45443136;
        p32[221] = 0x35443339;
        p32[222] = 0x44343731;
        p32[223] = 0x38453636;
        p32[224] = 0x45323833;
        p32[225] = 0x32424239;
        p32[226] = 0x34384546;
        p32[227] = 0x00373445;
        for(i = 228; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x0000023b;
        p32[237] = 0x0000000a;
        p32[238] = 0x00000005;
        p32[239] = 0x00000002;
        p32[240] = 0x00000001;
        break;
    case CURVE_K_163:
        p32[  0] = 0x00000005;
        p32[  1] = 0x00000029;
        for(i = 2; i <= 11; i++)
            p32[i] = 0x30303030;

        p32[ 12] = 0x00000031;
        for(i = 13; i <= 37; i++)
            p32[i] = 0x00000000;

        for(i = 38; i <= 47; i++)
            p32[i] = 0x30303030;

        p32[ 48] = 0x00000031;
        for(i = 49; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x31656632;
        p32[ 75] = 0x35306333;
        p32[ 76] = 0x62623733;
        p32[ 77] = 0x61313163;
        p32[ 78] = 0x30616163;
        p32[ 79] = 0x39376437;
        p32[ 80] = 0x34656433;
        p32[ 81] = 0x35643665;
        p32[ 82] = 0x39633565;
        p32[ 83] = 0x65656534;
        p32[ 84] = 0x00000038;
        for(i = 85; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x30393832;
        p32[111] = 0x62663037;
        p32[112] = 0x33643530;
        p32[113] = 0x35666638;
        p32[114] = 0x31323338;
        p32[115] = 0x38653266;
        p32[116] = 0x33353030;
        p32[117] = 0x33356436;
        p32[118] = 0x64636338;
        p32[119] = 0x64336161;
        p32[120] = 0x00000039;
        for(i = 121; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000031;
        p32[192] = 0x30303034;
        for(i = 193; i <= 196; i++)
            p32[i] = 0x30303030;

        p32[197] = 0x30313032;
        p32[198] = 0x45324138;
        p32[199] = 0x30434330;
        p32[200] = 0x46393944;
        p32[201] = 0x45354138;
        p32[202] = 0x00000046;
        for(i = 203; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x000000a3;
        p32[237] = 0x00000007;
        p32[238] = 0x00000006;
        p32[239] = 0x00000003;
        p32[240] = 0x00000001;
        break;
    case CURVE_K_233:
        p32[  0] = 0x00000006;
        p32[  1] = 0x0000003b;
        for(i = 2; i <= 15; i++)
            p32[i] = 0x30303030;

        p32[ 16] = 0x00303030;
        for(i = 17; i <= 37; i++)
            p32[i] = 0x00000000;

        for(i = 38; i <= 51; i++)
            p32[i] = 0x30303030;

        p32[ 52] = 0x00313030;
        for(i = 53; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x33323731;
        p32[ 75] = 0x38616232;
        p32[ 76] = 0x37613335;
        p32[ 77] = 0x31333765;
        p32[ 78] = 0x32316661;
        p32[ 79] = 0x32326639;
        p32[ 80] = 0x31346666;
        p32[ 81] = 0x36353934;
        p32[ 82] = 0x31346133;
        p32[ 83] = 0x36326339;
        p32[ 84] = 0x30356662;
        p32[ 85] = 0x39633461;
        p32[ 86] = 0x65653664;
        p32[ 87] = 0x36646166;
        p32[ 88] = 0x00363231;
        for(i = 89; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x35626431;
        p32[111] = 0x65643733;
        p32[112] = 0x31386563;
        p32[113] = 0x66376239;
        p32[114] = 0x35663037;
        p32[115] = 0x36613535;
        p32[116] = 0x32346337;
        p32[117] = 0x63386137;
        p32[118] = 0x66623964;
        p32[119] = 0x65613831;
        p32[120] = 0x35623962;
        p32[121] = 0x63306536;
        p32[122] = 0x35303131;
        p32[123] = 0x65616636;
        p32[124] = 0x00336136;
        for(i = 125; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000046;
        p32[192] = 0x30303038;
        for(i = 193; i <= 198; i++)
            p32[i] = 0x30303030;

        p32[199] = 0x44393630;
        p32[200] = 0x39424235;
        p32[201] = 0x43423531;
        p32[202] = 0x45363444;
        p32[203] = 0x41314246;
        p32[204] = 0x31463544;
        p32[205] = 0x42413337;
        p32[206] = 0x00004644;
        for(i = 207; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x000000e9;
        p32[237] = 0x0000004a;
        p32[238] = 0x0000004a;
        p32[239] = 0x0000004a;
        p32[240] = 0x00000001;
        break;
    case CURVE_K_283:
        p32[  0] = 0x00000007;
        p32[  1] = 0x00000047;
        for(i = 2; i <= 18; i++)
            p32[i] = 0x30303030;

        p32[ 19] = 0x00303030;
        for(i = 20; i <= 37; i++)
            p32[i] = 0x00000000;

        for(i = 38; i <= 54; i++)
            p32[i] = 0x30303030;

        p32[ 55] = 0x00313030;
        for(i = 56; i <= 73; i++)
            p32[i] = 0x00000000;

        p32[ 74] = 0x32333035;
        p32[ 75] = 0x37663331;
        p32[ 76] = 0x34616338;
        p32[ 77] = 0x33383834;
        p32[ 78] = 0x33613166;
        p32[ 79] = 0x36313862;
        p32[ 80] = 0x38316632;
        p32[ 81] = 0x35356538;
        p32[ 82] = 0x32646333;
        p32[ 83] = 0x32663536;
        p32[ 84] = 0x35316333;
        p32[ 85] = 0x31613736;
        p32[ 86] = 0x36373836;
        p32[ 87] = 0x62333139;
        p32[ 88] = 0x61326330;
        p32[ 89] = 0x35343263;
        p32[ 90] = 0x32393438;
        p32[ 91] = 0x00363338;
        for(i = 92; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x64636331;
        p32[111] = 0x30383361;
        p32[112] = 0x39633166;
        p32[113] = 0x38313365;
        p32[114] = 0x66303964;
        p32[115] = 0x30643539;
        p32[116] = 0x34356537;
        p32[117] = 0x65663632;
        p32[118] = 0x34653738;
        p32[119] = 0x65306335;
        p32[120] = 0x34383138;
        p32[121] = 0x65383936;
        p32[122] = 0x36393534;
        p32[123] = 0x34363332;
        p32[124] = 0x31343365;
        p32[125] = 0x37313631;
        p32[126] = 0x32646437;
        p32[127] = 0x00393532;
        for(i = 128; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x00000055;
        p32[192] = 0x46464631;
        for(i = 193; i <= 199; i++)
            p32[i] = 0x46464646;

        p32[200] = 0x45464646;
        p32[201] = 0x32454139;
        p32[202] = 0x37304445;
        p32[203] = 0x32373735;
        p32[204] = 0x46443536;
        p32[205] = 0x39463746;
        p32[206] = 0x31353434;
        p32[207] = 0x31363045;
        p32[208] = 0x33363145;
        p32[209] = 0x00313643;
        for(i = 210; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x0000011b;
        p32[237] = 0x0000000c;
        p32[238] = 0x00000007;
        p32[239] = 0x00000005;
        p32[240] = 0x00000001;
        break;
    case CURVE_K_409:
        p32[  0] = 0x00000008;
        p32[  1] = 0x00000067;
        for(i = 2; i <= 26; i++)
            p32[i] = 0x30303030;

        p32[ 27] = 0x00303030;
        for(i = 28; i <= 37; i++)
            p32[i] = 0x00000000;

        for(i = 38; i <= 62; i++)
            p32[i] = 0x30303030;

        p32[ 63] = 0x00313030;
        for(i = 64; i <= 73; i++)
            p32[i] = 0x00000000;

