ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
        p32[ 74] = 0x66303630;
        p32[ 75] = 0x36663530;
        p32[ 76] = 0x34663835;
        p32[ 77] = 0x61316339;
        p32[ 78] = 0x62613364;
        p32[ 79] = 0x30393831;
        p32[ 80] = 0x38313766;
        p32[ 81] = 0x30313234;
        p32[ 82] = 0x30646665;
        p32[ 83] = 0x65373839;
        p32[ 84] = 0x63373033;
        p32[ 85] = 0x32633438;
        p32[ 86] = 0x63636137;
        p32[ 87] = 0x66386266;
        p32[ 88] = 0x37366639;
        p32[ 89] = 0x63326363;
        p32[ 90] = 0x31303634;
        p32[ 91] = 0x62653938;
        p32[ 92] = 0x61616135;
        p32[ 93] = 0x65323661;
        p32[ 94] = 0x32323265;
        p32[ 95] = 0x62316265;
        p32[ 96] = 0x34353533;
        p32[ 97] = 0x65666330;
        p32[ 98] = 0x33323039;
        p32[ 99] = 0x00363437;
        for(i = 100; i <= 109; i++)
            p32[i] = 0x00000000;

        p32[110] = 0x36336531;
        p32[111] = 0x30353039;
        p32[112] = 0x34633762;
        p32[113] = 0x61323465;
        p32[114] = 0x31616263;
        p32[115] = 0x62636164;
        p32[116] = 0x32343066;
        p32[117] = 0x33633939;
        p32[118] = 0x37303634;
        p32[119] = 0x39663238;
        p32[120] = 0x61653831;
        p32[121] = 0x65373234;
        p32[122] = 0x35323336;
        p32[123] = 0x65353631;
        p32[124] = 0x31616539;
        p32[125] = 0x64336530;
        p32[126] = 0x36663561;
        p32[127] = 0x65323463;
        p32[128] = 0x35356339;
        p32[129] = 0x61353132;
        p32[130] = 0x61633961;
        p32[131] = 0x35613732;
        p32[132] = 0x65333638;
        p32[133] = 0x64383463;
        p32[134] = 0x32306538;
        p32[135] = 0x00623638;
        for(i = 136; i <= 145; i++)
            p32[i] = 0x00000000;

        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x0000007b;
        p32[192] = 0x46464637;
        for(i = 193; i <= 203; i++)
            p32[i] = 0x46464646;

        p32[204] = 0x45464646;
        p32[205] = 0x33384635;
        p32[206] = 0x34443242;
        p32[207] = 0x30324145;
        p32[208] = 0x45303034;
        p32[209] = 0x35353443;
        p32[210] = 0x45354437;
        p32[211] = 0x33453344;
        p32[212] = 0x41433745;
        p32[213] = 0x42344235;
        p32[214] = 0x33384335;
        p32[215] = 0x30453842;
        p32[216] = 0x46354531;
        p32[217] = 0x00004643;
        for(i = 218; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x00000199;
        p32[237] = 0x00000057;
        p32[238] = 0x00000057;
        p32[239] = 0x00000057;
        p32[240] = 0x00000001;
        break;
    case CURVE_K_571:
        p32[  0] = 0x00000009;
        p32[  1] = 0x0000008f;
        for(i = 2; i <= 36; i++)
            p32[i] = 0x30303030;

        p32[ 37] = 0x00303030;
        for(i = 38; i <= 72; i++)
            p32[i] = 0x30303030;

        p32[ 73] = 0x00313030;
        p32[ 74] = 0x62653632;
        p32[ 75] = 0x35386137;
        p32[ 76] = 0x33323939;
        p32[ 77] = 0x38636266;
        p32[ 78] = 0x39383132;
        p32[ 79] = 0x66313336;
        p32[ 80] = 0x33303138;
        p32[ 81] = 0x61346566;
        p32[ 82] = 0x61633963;
        p32[ 83] = 0x30373932;
        p32[ 84] = 0x64323130;
        p32[ 85] = 0x36346435;
        p32[ 86] = 0x38343230;
        p32[ 87] = 0x30383430;
        p32[ 88] = 0x31343831;
        p32[ 89] = 0x34346163;
        p32[ 90] = 0x39303733;
        p32[ 91] = 0x39343835;
        p32[ 92] = 0x30326233;
        p32[ 93] = 0x34366535;
        p32[ 94] = 0x33616437;
        p32[ 95] = 0x62643430;
        p32[ 96] = 0x62656334;
        p32[ 97] = 0x62633830;
        p32[ 98] = 0x62316462;
        p32[ 99] = 0x34393361;
        p32[100] = 0x37373439;
        p32[101] = 0x39626636;
        p32[102] = 0x34623838;
        p32[103] = 0x34373137;
        p32[104] = 0x38616364;
        p32[105] = 0x65376338;
        p32[106] = 0x35343932;
        p32[107] = 0x61333832;
        p32[108] = 0x38633130;
        p32[109] = 0x00323739;
        p32[110] = 0x64393433;
        p32[111] = 0x37303863;
        p32[112] = 0x62663466;
        p32[113] = 0x34373366;
        p32[114] = 0x65613466;
        p32[115] = 0x33656461;
        p32[116] = 0x39616362;
        p32[117] = 0x34313335;
        p32[118] = 0x38356464;
        p32[119] = 0x39636563;
        p32[120] = 0x37303366;
        p32[121] = 0x66343561;
        p32[122] = 0x31366366;
        p32[123] = 0x30636665;
        p32[124] = 0x38643630;
        p32[125] = 0x39633261;
        p32[126] = 0x37393464;
        p32[127] = 0x61306339;
        p32[128] = 0x61343463;
        p32[129] = 0x34376165;
        p32[130] = 0x62656266;
        p32[131] = 0x66396262;
        p32[132] = 0x61323737;
        p32[133] = 0x62636465;
        p32[134] = 0x62303236;
        p32[135] = 0x37613130;
        p32[136] = 0x61376162;
        p32[137] = 0x33623166;
        p32[138] = 0x33343032;
        p32[139] = 0x35386330;
        p32[140] = 0x38393139;
        p32[141] = 0x30366634;
        p32[142] = 0x34646331;
        p32[143] = 0x33343163;
        p32[144] = 0x63316665;
        p32[145] = 0x00336137;
        p32[146] = 0x00000044;
        for(i = 147; i <= 154; i++)
            p32[i] = 0x46464646;

        for(i = 155; i <= 159; i++)
            p32[i] = 0x30303030;

        p32[160] = 0x31303030;
        for(i = 161; i <= 190; i++)
            p32[i] = 0x00000000;

        p32[191] = 0x000000ac;
        p32[192] = 0x30303032;
        for(i = 193; i <= 208; i++)
            p32[i] = 0x30303030;

        p32[209] = 0x31303030;
        p32[210] = 0x35383133;
        p32[211] = 0x46314530;
        p32[212] = 0x36413931;
        p32[213] = 0x42344533;
        p32[214] = 0x41313933;
        p32[215] = 0x39424438;
        p32[216] = 0x34463731;
        p32[217] = 0x42383331;
        p32[218] = 0x44303336;
        p32[219] = 0x45423438;
        p32[220] = 0x33364435;
        p32[221] = 0x31383339;
        p32[222] = 0x44313945;
        p32[223] = 0x35344245;
        p32[224] = 0x37454643;
        p32[225] = 0x36463837;
        p32[226] = 0x31433733;
        p32[227] = 0x00313030;
        for(i = 228; i <= 235; i++)
            p32[i] = 0x00000000;

        p32[236] = 0x0000023b;
        p32[237] = 0x0000000a;
        p32[238] = 0x00000005;
        p32[239] = 0x00000002;
        p32[240] = 0x00000001;
        break;
    default:
        return -1;

