ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
    }

    return 0;
}



static ECC_CURVE * get_curve(E_ECC_CURVE ecc_curve)
{
    uint32_t   i;
    ECC_CURVE  *ret = NULL;

    if(CurveCpy((unsigned int *)&Curve_Copy, ecc_curve))
        return NULL;
    else
        return &Curve_Copy;

}


#else
static ECC_CURVE * get_curve(E_ECC_CURVE ecc_curve)
{
    uint32_t   i;
    ECC_CURVE  *ret = NULL;

    for(i = 0UL; i < sizeof(_Curve) / sizeof(ECC_CURVE); i++)
    {
        if(ecc_curve == _Curve[i].curve_id)
        {
            memcpy((char *)&Curve_Copy, &_Curve[i], sizeof(ECC_CURVE));
            ret = &Curve_Copy;   /* (ECC_CURVE *)&_Curve[i]; */
        }
        if(ret != NULL)
        {
            break;
        }
    }
    return ret;
}


/**
  * @brief  ECC interrupt service routine. User application must invoke this function in
  *         his CRYPTO_IRQHandler() to let Crypto driver know ECC processing was done.
  * @param[in]  crpt        Reference to Crypto module.
  * @return   none
  */
void ECC_Complete(CRPT_T *crpt)
{
    if (crpt->INTSTS & CRPT_INTSTS_ECCIF_Msk)
    {
        g_ECC_done = 1UL;
        crpt->INTSTS = CRPT_INTSTS_ECCIF_Msk;
        /* printf("ECC done IRQ.\n"); */
    }

    if (crpt->INTSTS & CRPT_INTSTS_ECCEIF_Msk)
    {
        g_ECCERR_done = 1UL;
        crpt->INTSTS = CRPT_INTSTS_ECCEIF_Msk;
        printf("ECCEIF flag is set!!\n");
    }
}


/*-----------------------------------------------------------------------------------------------*/
/*                                                                                               */
/*    RSA                                                                                        */
/*                                                                                               */
/*-----------------------------------------------------------------------------------------------*/

/** @cond HIDDEN_SYMBOLS */

static uint32_t au32RsaN[128]; /* The base of modulus operation word. */
static uint32_t au32RsaE[128]; /* The exponent of exponentiation words. */
static uint32_t au32RsaM[128]; /* The base of exponentiation words. */
static uint32_t au32RsaP[128]; /* The Factor of Modulus Operation. */
static uint32_t au32RsaQ[128]; /* The Factor of Modulus Operation. */
static uint32_t au32RsaTmpCp[128]; /* The Temporary Value(Cp) of RSA CRT. */
static uint32_t au32RsaTmpCq[128]; /* The Temporary Value(Cq) of RSA CRT. */
static uint32_t au32RsaTmpDp[128]; /* The Temporary Value(Dp) of RSA CRT. */
static uint32_t au32RsaTmpDq[128]; /* The Temporary Value(Dq) of RSA CRT. */
static uint32_t au32RsaTmpRp[128]; /* The Temporary Value(Rp) of RSA CRT. */
static uint32_t au32RsaTmpRq[128]; /* The Temporary Value(Rq) of RSA CRT. */
static uint32_t au32RsaTmpBlindKey[128]; /* The Temporary Value(blind key) of RSA SCAP. */
static uint32_t au32RsaOutput[128]; /* The RSA answer. */
static char RsaOutput[RSA_KBUF_HLEN];

/** @endcond HIDDEN_SYMBOLS */


/**
  * @brief  Open RSA encrypt/decrypt function.
  * @param[in]  crpt         The pointer of CRYPTO module
  * @param[in]  u32OpMode    RSA operation mode, including:
  *         - \ref RSA_MODE_NORMAL
  *         - \ref RSA_MODE_CRT
  *         - \ref RSA_MODE_CRTBYPASS
  *         - \ref RSA_MODE_SCAP
  *         - \ref RSA_MODE_CRT_SCAP
  *         - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  u32KeySize is RSA key size, including:
  *         - \ref RSA_KEY_SIZE_1024
  *         - \ref RSA_KEY_SIZE_2048
  *         - \ref RSA_KEY_SIZE_3072
  *         - \ref RSA_KEY_SIZE_4096
  * @return None
  */
void RSA_Open(CRPT_T *crpt, uint32_t u32OpMode, uint32_t u32KeySize)
{
    (void)RsaOutput;
    crpt->RSA_CTL = (u32OpMode) | (u32KeySize << CRPT_RSA_CTL_KEYLENG_Pos);
}

/**
  * @brief  Set the RSA key
  * @param[in]  crpt        The pointer of CRYPTO module
  * @param[in]  Key         The private or public key.
  * @return None
  */
void RSA_SetKey(CRPT_T *crpt, char *Key)
{
    (void)crpt;
    Hex2Reg(Key, (uint32_t *)&au32RsaE[0]);
    CRPT->RSA_SADDR[2] = (uint32_t)&au32RsaE[0]; /* the public key or private key */
}

/**
  * @brief  Set RSA DMA transfer configuration.
  * @param[in]  crpt         The pointer of CRYPTO module
  * @param[in]  u32OpMode    RSA operation mode, including:
  *         - \ref RSA_MODE_NORMAL
  *         - \ref RSA_MODE_CRT
  *         - \ref RSA_MODE_CRTBYPASS
  *         - \ref RSA_MODE_SCAP
  *         - \ref RSA_MODE_CRT_SCAP
  *         - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  Src   RSA DMA source data
  * @param[in]  n     The modulus for both the public and private keys
  * @param[in]  P     The factor of modulus operation(P) for CRT/SCAP mode
  * @param[in]  Q     The factor of modulus operation(Q) for CRT/SCAP mode
  * @return None
  */
void RSA_SetDMATransfer(CRPT_T *crpt, uint32_t u32OpMode, char *Src,
                        char *n, char *P, char *Q)
{
    Hex2Reg(Src, (uint32_t *)&au32RsaM[0]);
    Hex2Reg(n, (uint32_t *)&au32RsaN[0]);
    (void)crpt;

    /* Assign the data to DMA */
    CRPT->RSA_SADDR[0] = (uint32_t)&au32RsaM[0]; /* plaintext / encrypt data */
    CRPT->RSA_SADDR[1] = (uint32_t)&au32RsaN[0]; /* the base of modulus operation */
    CRPT->RSA_DADDR    = (uint32_t)&au32RsaOutput[0]; /* encrypt data / decrypt data */

    if ((u32OpMode & CRPT_RSA_CTL_CRT_Msk) || (u32OpMode & CRPT_RSA_CTL_SCAP_Msk))
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        Hex2Reg(P, (uint32_t *)&au32RsaP[0]);
        Hex2Reg(Q, (uint32_t *)&au32RsaQ[0]);

        CRPT->RSA_SADDR[3] = (uint32_t)&au32RsaP[0]; /* prime P */
        CRPT->RSA_SADDR[4] = (uint32_t)&au32RsaQ[0]; /* prime Q */
    }

    if (u32OpMode & CRPT_RSA_CTL_CRT_Msk)
    {
        CRPT->RSA_MADDR[0] = (uint32_t)&au32RsaTmpCp[0]; /* for storing the intermediate temporary value(Cp) */
        CRPT->RSA_MADDR[1] = (uint32_t)&au32RsaTmpCq[0]; /* for storing the intermediate temporary value(Cq) */
        CRPT->RSA_MADDR[2] = (uint32_t)&au32RsaTmpDp[0]; /* for storing the intermediate temporary value(Dp) */
        CRPT->RSA_MADDR[3] = (uint32_t)&au32RsaTmpDq[0]; /* for storing the intermediate temporary value(Dq) */
        CRPT->RSA_MADDR[4] = (uint32_t)&au32RsaTmpRp[0]; /* for storing the intermediate temporary value(Rp) */
        CRPT->RSA_MADDR[5] = (uint32_t)&au32RsaTmpRq[0]; /* for storing the intermediate temporary value(Rq) */
    }

    if (u32OpMode & CRPT_RSA_CTL_SCAP_Msk)
    {
        /* For SCAP mode to store the intermediate temporary value(blind key) */
        CRPT->RSA_MADDR[6] = (uint32_t)&au32RsaTmpBlindKey[0];
    }
}

/**
  * @brief  Start RSA encrypt/decrypt
  * @param[in]  crpt        The pointer of CRYPTO module
  * @return None
  */
void RSA_Start(CRPT_T *crpt)
{
    crpt->RSA_CTL |= CRPT_RSA_CTL_START_Msk;
}

/**
  * @brief  Read the RSA output.
  * @param[in]   crpt       The pointer of CRYPTO module
  * @param[out]  Output     The RSA operation output data.
  * @return None
  */
void RSA_Read(CRPT_T *crpt, char *Output)
{
    uint32_t au32CntTbl[4] = {256, 512, 768, 1024}; /* count is key length divided by 4 */
    uint32_t u32CntIdx = 0;

    u32CntIdx = (crpt->RSA_CTL & CRPT_RSA_CTL_KEYLENG_Msk) >> CRPT_RSA_CTL_KEYLENG_Pos;
    Reg2Hex((int32_t)au32CntTbl[u32CntIdx], (uint32_t *)au32RsaOutput, Output);
}

/**
  * @brief  Set the RSA key is read from key store
  * @param[in]  crpt           The pointer of CRYPTO module
  * @param[in]  u32KeyNum      The number of private or public key in key store.
  * @param[in]  u32KSMemType   The key is read from selected memory type of key store. It could be:
                            \ref KS_SRAM
                            \ref KS_FLASH
                            \ref KS_OTP
  * @return None
  */
void RSA_SetKeyAccessKeyStore(CRPT_T *crpt, uint32_t u32KeyNum, uint32_t u32KSMemType)
{
    (void)crpt;
    CRPT->RSA_KSCTL = (u32KSMemType << CRPT_RSA_KSCTL_RSSRC_Pos) | CRPT_RSA_KSCTL_RSRC_Msk | u32KeyNum;
}

/**
  * @brief  Set RSA DMA transfer configuration while using key store.
  * @param[in]  crpt         The pointer of CRYPTO module
  * @param[in]  u32OpMode    RSA operation mode, including:
  *         - \ref RSA_MODE_NORMAL
  *         - \ref RSA_MODE_CRT
  *         - \ref RSA_MODE_CRTBYPASS
  *         - \ref RSA_MODE_SCAP
  *         - \ref RSA_MODE_CRT_SCAP
  *         - \ref RSA_MODE_CRTBYPASS_SCAP
  * @param[in]  Src   RSA DMA source data
  * @param[in]  n     The modulus for both the public and private keys
  * @param[in]  u32PNum         The number of the factor of modulus operation(P) in SRAM of key store for CRT/SCAP mode
  * @param[in]  u32QNum         The number of the factor of modulus operation(Q) in SRAM of key store for CRT/SCAP mode
  * @param[in]  u32CpNum        The number of Cp in SRAM of key store for CRT mode
  * @param[in]  u32CqNum        The number of Cq in SRAM of key store for CRT mode
  * @param[in]  u32DpNum        The number of Dp in SRAM of key store for CRT mode
  * @param[in]  u32DqNum        The number of Dq in SRAM of key store for CRT mode
  * @param[in]  u32RpNum        The number of Rp in SRAM of key store for CRT mode
  * @param[in]  u32RqNum        The number of Rq in SRAM of key store for CRT mode
  * @param[in]  u32BlindKeyNum  The number of blind key in SRAM of key store for SCAP mode. This key is un-readable.
  * @return None
  * @note P, Q, Dp, Dq are equal to half key length. Cp, Cq, Rp, Rq, Blind key are equal to key length.
  */
void RSA_SetDMATransferAccessKeyStore(CRPT_T *crpt, uint32_t u32OpMode, char *Src, char *n, uint32_t u32PNum,
                                      uint32_t u32QNum, uint32_t u32CpNum, uint32_t u32CqNum, uint32_t u32DpNum,
                                      uint32_t u32DqNum, uint32_t u32RpNum, uint32_t u32RqNum, uint32_t u32BlindKeyNum)
{
    (void)crpt;
    Hex2Reg(Src, (uint32_t *)&au32RsaM[0]);
    Hex2Reg(n, (uint32_t *)&au32RsaN[0]);

