ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2354/device/StdDriver/src/m2354_crypto.c
    /* Assign the data to DMA */
    CRPT->RSA_SADDR[0] = (uint32_t)&au32RsaM[0]; /* plaintext / encrypt data */
    CRPT->RSA_SADDR[1] = (uint32_t)&au32RsaN[0]; /* the base of modulus operation */
    CRPT->RSA_DADDR    = (uint32_t)&au32RsaOutput[0]; /* encrypt data / decrypt data */

    if ((u32OpMode & CRPT_RSA_CTL_CRT_Msk) || (u32OpMode & CRPT_RSA_CTL_SCAP_Msk))
    {
        /* For RSA CRT/SCAP mode, two primes of private key */
        CRPT->RSA_KSSTS[0] = (CRPT->RSA_KSSTS[0] & (~(CRPT_RSA_KSSTS0_NUM0_Msk | CRPT_RSA_KSSTS0_NUM1_Msk))) | \
                             (u32PNum << CRPT_RSA_KSSTS0_NUM0_Pos) | (u32QNum << CRPT_RSA_KSSTS0_NUM1_Pos);
    }

    if (u32OpMode & CRPT_RSA_CTL_CRT_Msk)
    {
        /* For RSA CRT mode, Cp, Cq, Dp, Dq, Rp, Rq */
        CRPT->RSA_KSSTS[0] = (CRPT->RSA_KSSTS[0] & (~(CRPT_RSA_KSSTS0_NUM2_Msk | CRPT_RSA_KSSTS0_NUM3_Msk))) | \
                             (u32CpNum << CRPT_RSA_KSSTS0_NUM2_Pos) | (u32CqNum << CRPT_RSA_KSSTS0_NUM3_Pos);
        CRPT->RSA_KSSTS[1] = (u32DpNum << CRPT_RSA_KSSTS1_NUM4_Pos) | (u32DqNum << CRPT_RSA_KSSTS1_NUM5_Pos) | \
                             (u32RpNum << CRPT_RSA_KSSTS1_NUM6_Pos) | (u32RqNum << CRPT_RSA_KSSTS1_NUM7_Pos);
    }

    if (u32OpMode & CRPT_RSA_CTL_SCAP_Msk)
    {
        /* For SCAP mode to store the intermediate temporary value(blind key) */
        CRPT->RSA_KSCTL = (CRPT->RSA_KSCTL & (~CRPT_RSA_KSCTL_BKNUM_Msk)) | (u32BlindKeyNum << 8); /* From SRAM in KS */
    }
}

#endif


/*@}*/ /* end of group CRYPTO_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group CRYPTO_Driver */

/*@}*/ /* end of group Standard_Driver */

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/

